gcc -g p3final.c
 ./a.out
entre 3 numbers
45
65
89
largest number is 89
 gcc -g p3final.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x83c: file p3final.c, line 27.
(gdb) l
13   if (b>c&&b>a)
14   {
15     *large=b;
16   } 
17   if(c>a&&c>b)
18   {
19     *large=c;
20   }
21  }
22  void output(int *large)
(gdb) r
Starting program: /home/runner/IA1-Revision-2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p3final.c:27
27  {
(gdb) n
 
 gcc -g p4final.c
 ./a.out
enter a value:
458
enter a value:
54643
enter a value:
32464
b is large
 
 gcc -g p4final.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
 
 gcc -g p4final.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x7e2: file p4final.c, line 27.
(gdb) l
13      printf("a is large\n");
14    }
15    else if(b>c&&b>a)
16    {
17      printf("b is large\n");
18    }
19    else if(c>a&&c>b)
20    {
21      printf("c is large\n"); 
22    }
(gdb) r
Starting program: /home/runner/IA1-Revision-2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p4final.c:27
27    a=input();
(gdb) n
enter a value:
45
28    b=input();
(gdb) n
enter a value:
689
29    c=input();
(gdb) n
enter a value:
7892315
30    cmp(a,b,c);
(gdb) n
c is large
31    return 0;
(gdb) c
Continuing.
[Inferior 1 (process 224) exited normally]
(gdb) 